{
	"nodes":[
		{"op":"null","name":"Input","inputs":[]},
		{"op":"slice_axis","name":"1.encEgoVelP$0","attrs":{"axis":"1","begin":"0","end":"1"},"inputs":[[0,0,0]]},
		{"op":"reshape","name":"1.encEgoVelP$1","attrs":{"shape":"(-1)"},"inputs":[[1,0,0]]},
		{"op":"flatten","name":"1.encEgoVelF","attrs":{},"inputs":[[2,0,0]]},
		{"op":"null","name":"1.encEgoVel.1.Weights","inputs":[]},
		{"op":"null","name":"1.encEgoVel.1.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.encEgoVel.1","attrs":{"num_hidden":"10","no_bias":"False"},"inputs":[[3,0,0],[4,0,0],[5,0,0]]},
		{"op":"sigmoid","name":"1.encEgoVel.2$0","inputs":[[6,0,0]]},
		{"op":"slice_axis","name":"1.encLongP$0","attrs":{"axis":"1","begin":"1","end":"2"},"inputs":[[0,0,0]]},
		{"op":"reshape","name":"1.encLongP$1","attrs":{"shape":"(-1)"},"inputs":[[8,0,0]]},
		{"op":"flatten","name":"1.encLongF","attrs":{},"inputs":[[9,0,0]]},
		{"op":"null","name":"1.encLong.1.Weights","inputs":[]},
		{"op":"null","name":"1.encLong.1.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.encLong.1","attrs":{"num_hidden":"10","no_bias":"False"},"inputs":[[10,0,0],[11,0,0],[12,0,0]]},
		{"op":"sigmoid","name":"1.encLong.2$0","inputs":[[13,0,0]]},
		{"op":"slice_axis","name":"1.encLatP$0","attrs":{"axis":"1","begin":"2","end":"3"},"inputs":[[0,0,0]]},
		{"op":"reshape","name":"1.encLatP$1","attrs":{"shape":"(-1)"},"inputs":[[15,0,0]]},
		{"op":"flatten","name":"1.encLatF","attrs":{},"inputs":[[16,0,0]]},
		{"op":"null","name":"1.encLat.1.Weights","inputs":[]},
		{"op":"null","name":"1.encLat.1.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.encLat.1","attrs":{"num_hidden":"10","no_bias":"False"},"inputs":[[17,0,0],[18,0,0],[19,0,0]]},
		{"op":"sigmoid","name":"1.encLat.2$0","inputs":[[20,0,0]]},
		{"op":"slice_axis","name":"1.encAngP$0","attrs":{"axis":"1","begin":"3","end":"4"},"inputs":[[0,0,0]]},
		{"op":"reshape","name":"1.encAngP$1","attrs":{"shape":"(-1)"},"inputs":[[22,0,0]]},
		{"op":"flatten","name":"1.encAngF","attrs":{},"inputs":[[23,0,0]]},
		{"op":"null","name":"1.encAng.1.Weights","inputs":[]},
		{"op":"null","name":"1.encAng.1.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.encAng.1","attrs":{"num_hidden":"5","no_bias":"False"},"inputs":[[24,0,0],[25,0,0],[26,0,0]]},
		{"op":"sigmoid","name":"1.encAng.2$0","inputs":[[27,0,0]]},
		{"op":"slice_axis","name":"1.encVelP$0","attrs":{"axis":"1","begin":"4","end":"5"},"inputs":[[0,0,0]]},
		{"op":"reshape","name":"1.encVelP$1","attrs":{"shape":"(-1)"},"inputs":[[29,0,0]]},
		{"op":"flatten","name":"1.encVelF","attrs":{},"inputs":[[30,0,0]]},
		{"op":"null","name":"1.encVel.1.Weights","inputs":[]},
		{"op":"null","name":"1.encVel.1.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.encVel.1","attrs":{"num_hidden":"5","no_bias":"False"},"inputs":[[31,0,0],[32,0,0],[33,0,0]]},
		{"op":"sigmoid","name":"1.encVel.2$0","inputs":[[34,0,0]]},
		{"op":"slice_axis","name":"1.encEgoRQSP$0","attrs":{"axis":"1","begin":"5","end":"6"},"inputs":[[0,0,0]]},
		{"op":"reshape","name":"1.encEgoRQSP$1","attrs":{"shape":"(-1)"},"inputs":[[36,0,0]]},
		{"op":"flatten","name":"1.encEgoRQSF","attrs":{},"inputs":[[37,0,0]]},
		{"op":"null","name":"1.encEgoRQS.1.Weights","inputs":[]},
		{"op":"null","name":"1.encEgoRQS.1.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.encEgoRQS.1","attrs":{"num_hidden":"10","no_bias":"False"},"inputs":[[38,0,0],[39,0,0],[40,0,0]]},
		{"op":"sigmoid","name":"1.encEgoRQS.2$0","inputs":[[41,0,0]]},
		{"op":"concat","name":"1.con$0","attrs":{"num_args":"6","dim":"1"},"inputs":[[7,0,0],[14,0,0],[21,0,0],[28,0,0],[35,0,0],[42,0,0]]},
		{"op":"null","name":"2.Weights","inputs":[]},
		{"op":"null","name":"2.Biases","inputs":[]},
		{"op":"FullyConnected","name":"2","attrs":{"num_hidden":"256","no_bias":"False"},"inputs":[[43,0,0],[44,0,0],[45,0,0]]},
		{"op":"relu","name":"3$0","inputs":[[46,0,0]]},
		{"op":"_RMinusScalar","name":"3$1","attrs":{"scalar":"0.0"},"inputs":[[46,0,0]]},
		{"op":"relu","name":"3$2","inputs":[[48,0,0]]},
		{"op":"_Div","name":"3$3","inputs":[[49,0,0],[46,0,0]]},
		{"op":"exp","name":"3$4","inputs":[[46,0,0]]},
		{"op":"_PlusScalar","name":"3$5","attrs":{"scalar":"-1.0"},"inputs":[[51,0,0]]},
		{"op":"_Mul","name":"3$6","inputs":[[50,0,0],[52,0,0]]},
		{"op":"_Minus","name":"3$7","inputs":[[47,0,0],[53,0,0]]},
		{"op":"null","name":"4.Weights","inputs":[]},
		{"op":"null","name":"4.Biases","inputs":[]},
		{"op":"FullyConnected","name":"4","attrs":{"num_hidden":"3","no_bias":"False"},"inputs":[[54,0,0],[55,0,0],[56,0,0]]},
		{"op":"identity","name":"Output","inputs":[[57,0,0]]}
	],
	"arg_nodes":[0,4,5,11,12,18,19,25,26,32,33,39,40,44,45,55,56],
	"heads":[[58,0,0]],
	"attrs":{
		"mxnet_version":["int",10500]
	}
}